# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install fish shell
brew 'fish'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Binaries
brew 'git'
brew 'wget'
brew 'thefuck'
brew 'fswatch'
brew 'go'
brew 'awscli'
brew 'tree'
brew 'stow'
brew 'macvim', args: ['with-override-system-vim']
brew 'cmake'
brew 'the_silver_searcher'

# Development

