# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zplug'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Binaries
brew 'git'
brew 'wget'
brew 'thefuck'
brew 'fswatch'
brew 'go'
brew 'awscli'
brew 'tree'
brew 'stow'
brew 'cmake'
brew 'lnav'
brew 'fasd'
brew 'httpie'
brew 'python@2'
brew 'maven'

# Install some fonts
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'

